#include "WdgM.h"

/**********************************************************************
*函数名称  : void WdgM_Init(void)
*参数      : void
*返回值    : void
*描述      : 看门狗初始化
*编辑时间  :
*初版
*备注      :
***********************************************************************/
void WdgM_Init(void)
{
    WdgIf_SetMode(WDGIF_MODE_IWDT);
    WdgIf_Init();
}

/**********************************************************************
*函数名称  : void WdgM_Trigger(void)
*参数      : void
*返回值    : void
*描述      : 触发看门狗
*编辑时间  :
*初版
*备注      :
***********************************************************************/
void WdgM_Trigger(void)
{
    WdgIf_Trigger();
}
